app/controllers/movies_controller.rb

  def index
    @all_ratings=Movie.all_ratings

    session[:params] ||= {}
    session[:params][:ratings] ||= Hash[@all_ratings.collect { |v| [v, 1] }]
---
SELECT "movies".* FROM "movies"